;-----------------------
; CLASSES
;-----------------------

[Spark X2SoldierClassTemplate]
ClassSummary="These durable robotic mechs are designed to support and protect the squad, absorbing fire and softening up targets."
AbilityTreeTitles[0]="Behemoth"
AbilityTreeTitles[1]="Trailblazer"
AbilityTreeTitles[2]="Arbalest"

;-----------------------
; ABILITIES
;-----------------------

[RoboticChassis X2AbilityTemplate]
LocFriendlyName="Mechatronic"
LocLongDescription="This unit is immune to fire and poison damage, and provides full cover to adjacent allies."
LocHelpText="This unit is immune to fire and poison damage, and provides full cover to adjacent allies."

[Rainmaker X2AbilityTemplate]
LocFriendlyName="Shellshock Protocol"
LocLongDescription="Equipped heavy weapons deal +<Ability:Rainmaker_BonusDamage/> damage and have increased area of effect."
LocHelpText="Equipped heavy weapons deal more damage and affect a larger area."
LocPromotionPopupText="<Bullet/> Shellshock Protocol adds +<Ability:Rainmaker_BonusDamage/> damage to all heavy weapons.<br/><Bullet/> Heavy weapons with circular areas of effect have their radius increased by +<Ability:Rainmaker_BonusRadius/>.<br/><Bullet/> Heavy weapons with conic areas of effect have their diameter increased by +<Ability:Rainmaker_BonusDiameter/> and length increased by +<Ability:Rainmaker_BonusLength/>.<br/>"

[RepairMW X2AbilityTemplate]
LocFriendlyName="Repair"
LocLongDescription="Send the BIT to a damaged robotic ally and heal it for 4HP, neutralize acid, and repair all shredded armor."
LocHelpText="Send the BIT to repair a damaged robotic ally."
LocFlyOverText="Repair"
LocPromotionPopupText="<Bullet/> The SPARK can use Repair to heal itself or other SPARKs during battle.<br/><Bullet/> Repair will restore 4HP, remove any acid, and reset the target's armor to maximum.<br/><Bullet/> Upgrading your BIT will grant more charges of Repair per mission.<br/><Bullet/> Repair has 2/3/4 charges per mission, depending on the equipped BIT.<br/><Bullet/> Using Repair as your first action will end your turn without the Rapid Repair ability.<br/><Bullet/> Repair has a 1-turn cooldown (cannot be used multiple times per turn).<br/>"

[KineticStrike X2AbilityTemplate]
LocFriendlyName="Kinetic Strike"
LocLongDescription="Attack any enemy within movement range with a devastating punch. 2-turn cooldown. Damage is dependent on equipped chassis."
LocHelpText="Attack any enemy within movement range with a devastating puch."
LocPromotionPopupText="<Bullet/> You can trigger the Kinetic Strike ability by placing the movement cursor over an enemy.<br/><Bullet/> A SPARK can perform a \"Dash\" move, using both actions to move, and still trigger a Strike against an adjacent enemy.<br/><Bullet/> Kinetic Strike will do 6/8/10 damage, depending on the equipped SPARK chassis.<br/><Bullet/> Kinetic Strike's chance to hit is based off the SPARK's aim with a +10 boost.<br/><Bullet/> Learning the Assault Servos ability will grant +2 damage and an extra +20 aim to all Kinetic Strike attacks.<br/>"

[Obliterator X2AbilityTemplate]
LocFriendlyName="Assault Servos"
LocLongDescription="Grants +2 damage to all Strike attacks, and ensures that every attack will hit. Also grants the Wrecking Ball ability."
LocHelpText="Grants +2 damage to all Kinetic Strike attacks, and ensures that every attack will hit."
LocPromotionPopupText="<Bullet/> Learning the Assault Servos ability will grant +2 damage and an extra +20 aim to all Kinetic Strike attacks.<br/><Bullet/> With the damage boost, Kinetic Strike's damage will be 8/10/12 depending on the equipped SPARK chassis.<br/><Bullet/> Half-damage Strike attacks gain only a +1 damage boost.<br/><Bullet/> Wrecking Ball is included with this ability. It allows the SPARK to destroy any environmental objects it passes by when using Overdrive.<br/><Bullet/> Combine a Wrecking Ball Overdrive with Kinetic Strike to not only strip a target's cover, but also deal large amounts of damage and have an action point afterwards.<br/>"

[RapidRepair X2AbilityTemplate]
LocFriendlyName="Rapid Repair"
LocLongDescription="Repair no longer ends the turn, allowing the SPARK to repair and take a different action such as moving or shooting."
LocHelpText="Repair no longer ends the SPARK's turn."
LocFlyOverText="Rapid Repair"
LocPromotionPopupText="<Bullet/> The SPARK's Repair ability no longer ends the turn.<br/><Bullet/> Repair still has a 1-turn cooldown, preventing it from being used twice in one turn.<br/><Bullet/> This allows the SPARK to be much more flexible on the battlefield while also keeping its health and armor high.<br/>"

[Reboot X2AbilityTemplate]
LocFriendlyName="Reboot"
LocLongDescription="If the SPARK takes enough damage to be killed, its health will be reduced to just 1 HP and it will be shielded for the rest of the turn. Can only trigger once every mission, and afterwards the SPARK is crippled."
LocHelpText="The SPARK will be shielded for one turn if it takes enough damage to be killed."
LocFlyOverText="Reboot"
LocPromotionPopupText="<Bullet/> The SPARK will be put into Stasis the first time each mission that its health hits zero.<br/><Bullet/> Without the Redundant Systems ability, the SPARK is crippled after rebooting from catastrophic damage, suffering massive penatlies to aim, mobility, and hacking.<br/><Bullet/> Because of these drawbacks, in combination with the SPARK's already low hull integrity at the time of a Reboot, it is recommended rebooted SPARKs be withdrawn from the battlefield via Skyranger when possible.<br/><Bullet/> Thanks to a complex network of redundant plating, reactivation circuits, and a single-charge shield projector, the SPARK can take one for the team secure in the knowledge that it will live to punch another day.<br/>"

[RebootTriggered X2AbilityTemplate]
LocFriendlyName="Reboot"
LocLongDescription="If the SPARK takes enough damage to be killed, its health will be reduced to just 1 HP and it will be shielded for the rest of the turn. Can only trigger once every mission, and afterwards the SPARK is crippled."
LocHelpText="The SPARK will be shielded for one turn if it takes enough damage to be killed."
LocFlyOverText="Reboot"
LocPromotionPopupText="<Bullet/> The SPARK will be put into Stasis the first time each mission that its health hits zero.<br/><Bullet/> Without the Redundant Systems ability, the SPARK is crippled after rebooting from catastrophic damage, suffering massive penatlies to aim, mobility, and hacking.<br/><Bullet/> Because of these drawbacks, in combination with the SPARK's already low hull integrity at the time of a Reboot, it is recommended rebooted SPARKs be withdrawn from the battlefield via Skyranger when possible.<br/><Bullet/> Thanks to a complex network of redundant plating, reactivation circuits, and a single-charge shield projector, the SPARK can take one for the team secure in the knowledge that it will live to punch another day.<br/>"

[RedundantSystems X2AbilityTemplate]
LocFriendlyName="Redundant Systems"
LocLongDescription="The SPARK no longer suffers any stat penalties from Reboot."
LocHelpText="The SPARK no longer suffers any stat penalties from Reboot."
LocFlyOverText="Redundant Systems"
LocPromotionPopupText="<Bullet/> The SPARK no longer suffers any stat penalties from Reboot.<br/><Bullet/> Without Redundant Systems, the SPARK is crippled after rebooting from catastrophic damage.<br/>"

[RedunSysTriggered X2AbilityTemplate]
LocFriendlyName="Redundant Systems"
LocLongDescription="If the SPARK takes enough damage to be killed, its health will be reduced to just 1 HP and it will be shielded for the rest of the turn. Can only trigger once every mission."
LocHelpText="The SPARK will be shielded for one turn if it takes enough damage to be killed."
LocFlyOverText="Redundant Systems"
LocPromotionPopupText="<Bullet/> The SPARK will be put into Stasis the first time each mission that its health hits zero.<br/><Bullet/> Thanks to a complex network of redundant plating, reactivation circuits, and a single-charge shield projector, the SPARK can take one for the team secure in the knowledge that it will live to punch another day.<br/>"

[HeavyRepair X2AbilityTemplate]
LocFriendlyName="Heavyduty Repair"
LocFlyOverText="Heavyduty Repair"
LocLongDescription="Repair heals four extra HP each use, doubling its recovery potential."
LocHelpText="Repair heals four extra HP each use."
LocPromotionPopupText="<Bullet/> The SPARK's repair ability will now heal 8 HP per use instead of 4 HP.<br/>"

[Collateral X2AbilityTemplate]
LocFriendlyName="Collateral Damage"
LocLongDescription="Fire a barrage of autocannon rounds to a location, destroying cover within the area. Deals a small amount of damage to enemies. 3-turn cooldown and uses 2 ammo."
LocHelpText="Fire a barrage of autocannon rounds to a location, destroying cover within the area."
LocFlyOverText="Collateral Damage"
LocPromotionPopupText="<Bullet/> Fire a barrage of autocannon rounds to a location, destroying cover within the area.<br/><Bullet/> Deals high environmental damage to all objects in the area of effect.<br/><Bullet/> Collateral Damage does 1.5/2.0/2.5 damage to enemies within the area of effect depending on tier of equipped autocannon.<br/><Bullet/> Costs 2 ammo and has a 3-turn cooldown.<br/>"

[BrawlerProtocol X2AbilityTemplate]
LocFriendlyName="Counterstrike"
LocLongDescription="The SPARK can throw free half-damage Strike attacks at any enemies who enter or attack from melee range. Does not require the Kinetic Strike ability."
LocHelpText="Free melee attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Counterstrike"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Counterstrike will trigger if that enemy moves to another adjacent tile or tries to attack the SPARK.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Counterstrike will trigger when that enemy moves into melee range.<br/><Bullet/> If an enemy begins their turn in an adjacent tile, Counterstrike will NOT trigger if that enemy moves directly away from the SPARK.<br/><Bullet/> Counterstrike deals half damage compared to the regular Kinetic Strike attack, and gains +1 damage from Assault Servos.<br/>"

[BrawlerTrigger X2AbilityTemplate]
LocFriendlyName="Counterstrike"
LocLongDescription="The SPARK can throw free half-damage Strike attacks at any enemies who enter or attack from melee range. Does not require the Kinetic Strike ability."
LocHelpText="Free melee attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Counterstrike"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Counterstrike will trigger if that enemy moves to another adjacent tile or tries to attack the SPARK.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Counterstrike will trigger when that enemy moves into melee range.<br/><Bullet/> If an enemy begins their turn in an adjacent tile, Counterstrike will NOT trigger if that enemy moves directly away from the SPARK.<br/><Bullet/> Counterstrike deals half damage compared to the regular Kinetic Strike attack, and gains +1 damage from Assault Servos.<br/>"

[Bombardment X2AbilityTemplate]
LocFriendlyName="Bombardment Protocol"
LocLongDescription="Launch the BIT to any visible location (including squadsight) where it releases a powerful explosive blast. 4-turn cooldown."
LocHelpText="Launch the BIT to blast away cover and damage all units in a radius."
LocPromotionPopupText="<Bullet/> Bombardment can be fired at any location within squadsight.<br/><Bullet/> Bombardment can be launched as the SPARK's first action without ending the turn.<br/><Bullet/> Bombardment deals 4-5/6-7/8-9 damage depending on the equipped BIT.<br/><Bullet/> Bombardment inflicts high environmental damage to the targeted area.<br/>"

[LightningStrikeMW X2AbilityTemplate]
LocFriendlyName="Lightning Strike"
LocLongDescription="A special Strike attack that does half damage but grants an action point after the attack. 4-turn cooldown."
LocHelpText="A special Strike attack that does half damage but grants an action point after the attack."
LocFlyOverText="Lightning Strike"
LocPromotionPopupText="<Bullet/> The action point granted by Lightning Strike can be used for anything, but the SPARK's tactical analysis programs recommend combining Lightning Strike with the Supernova ability.<br/><Bullet/> Lightning Strike can be combined with Overdrive to allow the SPARK four actions in a single turn.<br/><Bullet/> The damage of Lightning Strike without Assault Servos is 3/4/5 depending on equipped chassis.<br/><Bullet/> The damage of Lightning Strike with Assault Servos is 4/5/6 depending on equipped chassis.<br/>"

[ConcussiveStrike X2AbilityTemplate]
LocFriendlyName="Concussive Strike"
LocLongDescription="A special Strike attack that does half damage but stuns the target for two action points. Cannot target robotic units. 4-turn cooldown."
LocHelpText="A special Strike attack that does half damage but stuns the target for two action points."
LocFlyOverText="Concussive Strike"
LocPromotionPopupText="<Bullet/> Concussive Strike cannot target robotic units, as their processing centers aren't as squishy as brains.<br/><Bullet/> The damage of Concussive Strike without Assault Servos is 3/4/5 depending on equipped chassis.<br/><Bullet/> The damage of Concussive Strike with Assault Servos is 4/5/6 depending on equipped chassis.<br/>"

[Overclock X2AbilityTemplate]
LocFriendlyName="Overclock"
LocFlyOverText="Overclock"
LocLongDescription="When Overdrive is activated, the SPARK gains gargantuan bonuses to aim, mobility, crit chance, and hacking until the end of the turn. Also grants the Haywire Protocol ability."
LocHelpText="When Overdrive is activated, the SPARK gains gargantuan bonuses to aim, mobility, crit chance, and hacking until the end of the turn. Also grants the Haywire Protocol ability."
LocPromotionPopupText="<Bullet/> With a lot of battlefield experience, the SPARK's limits have been thouroughly tested and Shen believes that the standard Overdriving of the the main CPU could go even farther.<br/><Bullet/> When Overdrive is activated, the SPARK will gain +5 Mobility, +15 Aim, +30 Critical and +100 Hacking until the end of the turn.<br/><Bullet/> In addition, the SPARK gains the Haywire Protocol ability to use at will.<br/>"

[OverclockPassive X2AbilityTemplate]
LocFriendlyName="Overclock"
LocFlyOverText="Overclock"
LocLongDescription="When Overdrive is activated, the SPARK gains gargantuan bonuses to aim, mobility, crit chance, and hacking until the end of the turn. Also grants the Haywire Protocol ability."
LocHelpText="When Overdrive is activated, the SPARK gains gargantuan bonuses to aim, mobility, crit chance, and hacking until the end of the turn. Also grants the Haywire Protocol ability."
LocPromotionPopupText="<Bullet/> With a lot of battlefield experience, the SPARK's limits have been thouroughly tested and Shen believes that the standard Overdriving of the the main CPU could go even farther.<br/><Bullet/> When Overdrive is activated, the SPARK will gain +5 Mobility, +15 Aim, +30 Critical and +100 Hacking until the end of the turn.<br/><Bullet/> In addition, the SPARK gains the Haywire Protocol ability to use at will.<br/>"

[Neutralize X2AbilityTemplate]
LocFriendlyName="Neutralize Protocol"
LocLongDescription="Launch the BIT to a location, disabling enemy weapons in a small radius and forcing them to reload. This ability does not cost an action and has a 5-turn cooldown."
LocHelpText="Launch the BIT to a location, disabling enemy weapons in a small radius and forcing them to reload. This ability does not cost an action."
LocFlyOverText="Neutralize Protocol"
LocPromotionPopupText="<Bullet/> Send the BIT to release a short-range jamming pulse that overloads weapon systems. Forces targets to reload their primary weapon.<br/><Bullet/> Targeted enemies can use Reload to unjam their weapon. Enemies may choose to get by with just one action point of movement and shooting to work with, or they may forgo a reload and resort to secondary weapon systems.<br/><Bullet/> Neutralize Protocol does not cost an action to use and has a 5-turn cooldown.<br/>"

[Triangulation X2AbilityTemplate]
LocFriendlyName="Triangulate"
LocLongDescription="When the SPARK is attacked, the squad gains +10 aim against that target on the following turn."
LocHelpText="When the SPARK is attacked, the squad gains +10 aim against that target on the following turn."
LocFlyOverText="Triangulate"
LocPromotionPopupText="<Bullet/> The SPARK can trace incoming ordnance back to their original owners, and upload that information to the rest of the team.<br/><Bullet/> Triangulate will not trigger if an enemy attacks one of the SPARK's squadmates.<br/>"

[TriangulationTrigger X2AbilityTemplate]
LocFriendlyName="Triangulate"
LocLongDescription="When the SPARK is attacked, the squad gains +10 aim against that target on the following turn."
LocHelpText="When the SPARK is attacked, the squad gains +10 aim against that target on the following turn."
LocFlyOverText="Triangulate"
LocPromotionPopupText="<Bullet/> The SPARK can trace incoming ordnance back to their original owners, and upload that information to the rest of the team.<br/><Bullet/> Triangulate will not trigger if an enemy attacks one of the SPARK's squadmates.<br/>"

[LayeredArmour X2AbilityTemplate]
LocFriendlyName="Layered Armour"
LocLongDescription="Any single source of damage to the SPARK cannot destroy more than 40% of the SPARK's max HP."
LocHelpText="Any single source of damage to the SPARK cannot destroy more than 40% of the SPARK's max HP."
LocFlyOverText="Layered Armour"
LocPromotionPopupText="<Bullet/> Thanks to a new design technique that Shen cooked up, the SPARK's plating is now triple-hulled. Any damage to one hull can't spread to another.<br/><Bullet/> The SPARK's maximum damage taken is equal to its max HP multiplied by 0.4. The result is rounded to the nearest whole number.<br/>"

[Supernova X2AbilityTemplate]
LocFriendlyName="Supernova"
LocLongDescription="Dash to a location and overload the SPARK's reactor, dealing immense damage to all nearby units. The SPARK will be stunned for 1 turn."
LocHelpText="Dash to a location and overload the SPARK's reactor, dealing immense damage to all nearby units. The SPARK will be stunned for 1 turn."
LocPromotionPopupText="<Bullet/> Overload the SPARK's reactor, flooding the area with lethal radiation that rips apart organics and corrupts the computer memory of robotics. The SPARK must shut down for a time after the blast in order to recover from the energies unleashed.<br/><Bullet/> Supernova has one charge per mission.<br/><Bullet/> The SPARK can combine a move and Supernova into a single action (or two for a dash).<br/><Bullet/> All nearby robotic enemies will be stunned for two action points.<br/>"

[BondmateTeamwork_Spark X2AbilityTemplate]
LocFriendlyName="Teamwork"
LocHelpText="Grant an additional action point to a bondmate. Has a single charge shared between bondmates."
LocLongDescription="Grant an additional action point to a bondmate. Has a single charge shared between bondmates."

[BondmateTeamwork_Improved_Spark X2AbilityTemplate]
LocFriendlyName="Advanced Teamwork"
LocHelpText="Grant an additional action point to a bondmate. Has two charges per mission, shared between bondmates."
LocLongDescription="Grant an additional action point to a bondmate. Has two charges per mission, shared between bondmates."

[HaywireProtocol X2AbilityTemplate]
LocFriendlyName="Haywire Protocol"
LocLongDescription="You may target robotic and mechanical enemies with your <Ability:SecondaryWeaponName/>, attempting to hack them and seize control."
LocHelpText="Attempt to seize control of targeted enemy robot."
LocFlyOverText="Haywire Protocol"
LocPromotionPopupText="<Bullet/> Hacking a robotic enemy or turret pits the <Ability:ClassName/>'s Hacking stat against the enemy's Tech Defense stat.<br/><Bullet/> Upgrading your <Ability:SecondaryWeaponName/> will lead to an increased Hacking stat.<br/><Bullet/> Hacked robotic enemies can only be controlled for a short time.<br/>"

[FusionReactor X2AbilityTemplate]
LocFriendlyName="Fusion Reactor"
LocLongDescription="Every time you are targeted, part of the energy is absorbed. This energy is released to heal the SPARK at the end of the turn."
LocHelpText="Absorb energy when targeted by enemies, and release it at the end of the turn to repair damage."
LocFlyOverText="Energy Absorbed: +1"
LocPromotionPopupText=""

;-----------------------
; TECHS
;-----------------------

[BuildSpark X2TechTemplate]
DisplayName="Build Squire SPARK"
Summary="Build a SPARK robotic combat unit with a new personality matrix and with baseline combat data. (Starting rank: Squire/Squaddie)"

[BuildExpSpark X2TechTemplate]
DisplayName="Build Cavalier SPARK"
Summary="Build a SPARK robotic combat unit with a new personality matrix and with a significant upload of recorded combat data. (Starting rank: Cavalier/Lieutenant)"

[RebuildSpark X2TechTemplate]
DisplayName="Rebuild SPARK"
Summary="Build a new SPARK chassis and insert a recovered memory core. The unit will have the same personality as its predecessor. Unfortunately, the unit's combat data is lost forever. (NOTE: Apologies, this is not intended. I am working on a fix to allow rebuilt units to regain their ranks.)"

[ExpandRepairBay X2TechTemplate]
DisplayName="Expand Repair Bay"
Summary="With our new knowledge of ADVENT's MEC construction techniques, we can add another SPARK maintenance bay to Engineering, allowing two SPARKs to be repaired at one time."

;-----------------------
; ITEMS
;-----------------------

[CorpseSPARK X2ItemTemplate]
FriendlyName="SPARK Datacore"
FriendlyNamePlural="SPARK Datacores"
BriefSummary="The datacore of a XCOM SPARK that has fallen in combat. Can be inserted into a new SPARK in the Proving Grounds to regain the SPARK's personality. Unfortunately, it has taken severe battle damage." 

;-----------------------
; STAFF SLOTS
;-----------------------

[SparkStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: SPARK REQUIRED"
BonusEmptyText="Begin SPARK repairs."
BonusText="REPAIRING SPARK"
FilledText="%UNITNAME is receiving repairs!"
LockedText="NO DAMAGED SPARKs"

[SparkStaffSlot2 X2StaffSlotTemplate]
EmptyText="OPEN: SPARK REQUIRED"
BonusEmptyText="Begin SPARK repairs."
BonusText="REPAIRING SPARK"
FilledText="%UNITNAME is receiving repairs!"
LockedText="NO DAMAGED SPARKs"

;-----------------------
; SCHEMATICS
;-----------------------

[X2SchematicTemplate]

[Cannon_MG_Schematic X2SchematicTemplate]
m_strClassLabel="GRENADIER/SPARK"
[Cannon_BM_Schematic X2SchematicTemplate]
m_strClassLabel="GRENADIER/SPARK"

[Gremlin_MG_Schematic X2SchematicTemplate]
m_strClassLabel="SPECIALIST/SPARK"
[Gremlin_BM_Schematic X2SchematicTemplate]
m_strClassLabel="SPECIALIST/SPARK"

[MediumPlatedArmor_Schematic X2SchematicTemplate]
m_strClassLabel="SQUAD/SPARK"
[MediumPoweredArmor_Schematic X2SchematicTemplate]
m_strClassLabel="SQUAD/SPARK"